УТ_для_edt.РасширениеСмарт/src/Catalogs/Назначения/Назначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Назначения</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДвиженияПоСкладскимРегистрам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьТолькоНаличие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтакнаяИнформацияПартнераАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартОсновнойМенеджерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартДилерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перепродавец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерКонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПропускнаяСистема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставкиТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерПлатильщикЗаДоставкуГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="431ea12d-0bcd-44da-8c13-8fd3e3e1a591">
    <name>смартДилерБывший</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d8288f2-9450-4c32-b3b2-af0cc494cf90">
    <name>смартКлючевойКлиентПоРасходнымМатериалам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОборудованиеКлиентов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартНаименованиеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартОборудованиеКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартЧернилаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартЧернилаКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a039b99d-5c3e-46bf-b321-17891d574d3e">
    <name>смартВидыДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b5fe9406-a0b5-49eb-9e30-99dd19a7a18b">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c9650fb8-3e0f-4ca1-b198-3b3d9b8f018c">
    <name>смартТипичноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="082a786c-a92a-457f-bce6-eb2074d564f5">
      <name>ТипичноеОборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Назначения/ManagerModule.bsl
#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("ПредставлениеНазначения")
Функция смарт_ПредставлениеНазначения(КлючевыеПоля, РеквизитыДокумента)

	ПредставлениеНазначения = Неопределено;
	ПредставлениеТипаНазначения = Неопределено;
	
	#Вставка
	//++ #5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка
	Если КлючевыеПоля.ТипНазначения = Перечисления.ТипыНазначений.смартТоварВыведенныйИзОборота Тогда			
		Если ЗначениеЗаполнено(КлючевыеПоля.смартВыведеннаяИзОборотаСерия) Тогда
			ПредставлениеНазначения = НСтр("ru = 'Товар выведенный из оборота, %ПричинаВыводаТоваровИзОборота%, %Номенклатура%, %Серия%'");
		Иначе
			ПредставлениеНазначения = НСтр("ru = 'Товар выведенный из оборота, %ПричинаВыводаТоваровИзОборота%, %Номенклатура%'");
		КонецЕсли;
		
		Если КлючевыеПоля.смартПричинаВыводаИзОборота = Перечисления.смартПричиныВыводаТоваровИзОборота.Другое Тогда
			ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%ПричинаВыводаТоваровИзОборота%", КлючевыеПоля.смартУточнениеПричиныВыводаИзОборота);
		Иначе
			ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%ПричинаВыводаТоваровИзОборота%", КлючевыеПоля.смартПричинаВыводаИзОборота);
		КонецЕсли;
		
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%Номенклатура%", 	КлючевыеПоля.смартВыведеннаяИзОборотаНоменклатура);
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%Серия%", 			КлючевыеПоля.смартВыведеннаяИзОборотаСерия); 
		
		Возврат ПредставлениеНазначения; 
	КонецЕсли;
	//-- #5030 смарт: Тимофеева 02.02.26
	#КонецВставки

	Если ЗначениеЗаполнено(КлючевыеПоля.Заказ) И Не ЗначениеЗаполнено(КлючевыеПоля.Партнер) Тогда

		НомерЗаказа = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(РеквизитыДокумента.Номер);
		ДанныеЗаказа = Новый Структура("Представление, Номер", Строка(КлючевыеПоля.Заказ), РеквизитыДокумента.Номер);
		ПредставлениеЗаказа = ОбщегоНазначенияУТКлиентСервер.ПредставлениеОбъектаИзПредставленияСсылки(ДанныеЗаказа);

		Если ЗначениеЗаполнено(КлючевыеПоля.НаправлениеДеятельности) Тогда
			ПредставлениеНазначения = НСтр("ru = '%Получатель%, %Номер%, %Дата% (%ПредставлениеЗаказа%, %НаправлениеДеятельности%)'");
		Иначе
			ПредставлениеНазначения = НСтр("ru = '%Получатель%, %Номер%, %Дата% (%ПредставлениеЗаказа%)'");
		КонецЕсли;

		#Вставка
		//++ #Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.
		Если ТипЗнч(КлючевыеПоля.Заказ) = Тип("ДокументСсылка.смартЗаявкаНаРазборкуОборудования")
			ИЛИ ТипЗнч(КлючевыеПоля.Заказ) = Тип("ДокументОбъект.смартЗаявкаНаРазборкуОборудования") Тогда
			
			ПредставлениеНазначения = НСтр("ru = '%ЧтоПроизошло% %Оборудование%, %Серия% ЗРО № %Номер%, %Дата%'");
			
			Если КлючевыеПоля.смартРазобранноеОборудованиеТипНазначения = Перечисления.смартТипыНазначенийРазобранногоОборудования.СнятаяЗапаснаяЧасть Тогда
				ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%ЧтоПроизошло%", "Снято с");
			ИначеЕсли КлючевыеПоля.смартРазобранноеОборудованиеТипНазначения = Перечисления.смартТипыНазначенийРазобранногоОборудования.ПолученныйУзел Тогда
				ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%ЧтоПроизошло%", "Получен после разбора");
			ИначеЕсли КлючевыеПоля.смартРазобранноеОборудованиеТипНазначения = Перечисления.смартТипыНазначенийРазобранногоОборудования.НаЗаменуСнятойЗапаснойЧасти Тогда
				ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%ЧтоПроизошло%", "На замену снятого");
			Иначе
				ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%ЧтоПроизошло%", "???");
			КонецЕсли;
			
			ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%Оборудование%", КлючевыеПоля.смартРазобранноеОборудование);
			ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%Серия%", КлючевыеПоля.смартРазобранноеОборудованиеСерия);
			
		КонецЕсли;
		//-- #Б2340 смарт: Шляпников 17.02.2025
		#КонецВставки

		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%Получатель%",              РеквизитыДокумента.Получатель);
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%ПредставлениеЗаказа%",     ПредставлениеЗаказа);
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%Номер%",                   НомерЗаказа);
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%Дата%",                    Формат(РеквизитыДокумента.Дата, "ДЛФ=D"));
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%НаправлениеДеятельности%", КлючевыеПоля.НаправлениеДеятельности);

	ИначеЕсли ЗначениеЗаполнено(КлючевыеПоля.Заказ) И ЗначениеЗаполнено(КлючевыеПоля.Партнер) Тогда

		НомерЗаказа = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(РеквизитыДокумента.Номер);
		ДанныеЗаказа = Новый Структура("Представление, Номер", Строка(КлючевыеПоля.Заказ), РеквизитыДокумента.Номер);
		ПредставлениеЗаказа = ОбщегоНазначенияУТКлиентСервер.ПредставлениеОбъектаИзПредставленияСсылки(ДанныеЗаказа);

		Если ЗначениеЗаполнено(КлючевыеПоля.НаправлениеДеятельности) Тогда
			ПредставлениеНазначения = НСтр("ru = '%Получатель%, %Номер%, %Дата% (%ПредставлениеЗаказа%, %НаправлениеДеятельности%, %ПартнерДоговор%)'");
		Иначе
			ПредставлениеНазначения = НСтр("ru = '%Получатель%, %Номер%, %Дата% (%ПредставлениеЗаказа%, %ПартнерДоговор%)'");
		КонецЕсли;

		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%Получатель%",              РеквизитыДокумента.Получатель);
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%ПредставлениеЗаказа%",     ПредставлениеЗаказа);
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%Номер%",                   НомерЗаказа);
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%Дата%",                    Формат(РеквизитыДокумента.Дата, "ДЛФ=D"));
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%НаправлениеДеятельности%", КлючевыеПоля.НаправлениеДеятельности);
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%ПартнерДоговор%",          ?(ЗначениеЗаполнено(КлючевыеПоля.Договор), КлючевыеПоля.Договор, КлючевыеПоля.Партнер));

	ИначеЕсли ЗначениеЗаполнено(КлючевыеПоля.Договор) Тогда

		Если ЗначениеЗаполнено(КлючевыеПоля.НаправлениеДеятельности) И ЗначениеЗаполнено(КлючевыеПоля.ТипНазначения) Тогда
			ПредставлениеНазначения = НСтр("ru = '%ТипНазначения%: %Получатель% (%НаправлениеДеятельности%)'");
		ИначеЕсли ЗначениеЗаполнено(КлючевыеПоля.НаправлениеДеятельности) Тогда
			ПредставлениеНазначения = НСтр("ru = '%Получатель% (%НаправлениеДеятельности%)'");
		ИначеЕсли ЗначениеЗаполнено(КлючевыеПоля.ТипНазначения) Тогда
			ПредставлениеНазначения = НСтр("ru = '%ТипНазначения%: %Получатель%'");
		Иначе
			ПредставлениеНазначения = НСтр("ru = '%Получатель%'");
		КонецЕсли;

		Если КлючевыеПоля.ТипНазначения = Перечисления.ТипыНазначений.ДавальческоеМатериалы22 Тогда
			ПредставлениеТипаНазначения = НСтр("ru='Договор с давальцем'");
		Иначе
			ПредставлениеТипаНазначения = НСтр("ru='Договор с переработчиком'");
		КонецЕсли;

		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%Получатель%",              КлючевыеПоля.Договор);
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%НаправлениеДеятельности%", КлючевыеПоля.НаправлениеДеятельности);
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%ТипНазначения%",           ПредставлениеТипаНазначения);

	ИначеЕсли ЗначениеЗаполнено(КлючевыеПоля.Партнер) Тогда

		Если ЗначениеЗаполнено(КлючевыеПоля.НаправлениеДеятельности) И ЗначениеЗаполнено(КлючевыеПоля.ТипНазначения) Тогда
			ПредставлениеНазначения = НСтр("ru = '%ТипНазначения%: %Получатель% (%НаправлениеДеятельности%)'");
		ИначеЕсли ЗначениеЗаполнено(КлючевыеПоля.НаправлениеДеятельности) Тогда
			ПредставлениеНазначения = НСтр("ru = '%Получатель% (%НаправлениеДеятельности%)'");
		ИначеЕсли ЗначениеЗаполнено(КлючевыеПоля.ТипНазначения) Тогда
			ПредставлениеНазначения = НСтр("ru = '%ТипНазначения%: %Получатель%'");
		Иначе
			ПредставлениеНазначения = НСтр("ru = '%Получатель%'");
		КонецЕсли;

		Если КлючевыеПоля.ТипНазначения = Перечисления.ТипыНазначений.ДавальческоеМатериалы22 Тогда
			ПредставлениеТипаНазначения = НСтр("ru='Давалец'");
		Иначе
			ПредставлениеТипаНазначения = НСтр("ru='Переработчик'");
		КонецЕсли;

		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%Получатель%",              КлючевыеПоля.Партнер);
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%НаправлениеДеятельности%", КлючевыеПоля.НаправлениеДеятельности);
		ПредставлениеНазначения = СтрЗаменить(ПредставлениеНазначения, "%ТипНазначения%",           ПредставлениеТипаНазначения);

	Иначе

		ПредставлениеНазначения = Строка(КлючевыеПоля.НаправлениеДеятельности);

	КонецЕсли;

	Если Лев(ПредставлениеНазначения, 2) = ", " Тогда
		ПредставлениеНазначения = Сред(ПредставлениеНазначения, 3);
	КонецЕсли;

	Возврат ПредставлениеНазначения;

КонецФункции

&ИзменениеИКонтроль("ШаблонНового")
Функция смарт_ШаблонНового()

	Результат = Новый Структура();
	Результат.Вставить("НаправлениеДеятельности", Справочники.НаправленияДеятельности.ПустаяСсылка());
	Результат.Вставить("Партнер",                 Справочники.Партнеры.ПустаяСсылка());
	Результат.Вставить("Договор",                 Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	Результат.Вставить("Заказ",                   Неопределено);
	Результат.Вставить("ТипНазначения",           Перечисления.ТипыНазначений.Собственное);
	
	#Вставка
	//++ #Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.
	Результат.Вставить("смартРазобранноеОборудованиеТипНазначения", Перечисления.смартТипыНазначенийРазобранногоОборудования.ПустаяСсылка());
	Результат.Вставить("смартРазобранноеОборудование", Справочники.Номенклатура.ПустаяСсылка());
	Результат.Вставить("смартРазобранноеОборудованиеСерия", Справочники.СерииНоменклатуры.ПустаяСсылка());
	Результат.Вставить("смартРазобранноеОборудованиеУзел", Справочники.Номенклатура.ПустаяСсылка());
	//-- #Б2340 смарт: Шляпников 17.02.2025
	//++ #5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка
	Результат.Вставить("смартПричинаВыводаИзОборота", Перечисления.смартТипыНазначенийРазобранногоОборудования.ПустаяСсылка());
	Результат.Вставить("смартУточнениеПричиныВыводаИзОборота", ""); 
	Результат.Вставить("смартВыведеннаяИзОборотаНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
	Результат.Вставить("смартВыведеннаяИзОборотаСерия", Справочники.СерииНоменклатуры.ПустаяСсылка());
	//-- #5030 смарт: Тимофеева 02.02.26
	#КонецВставки

	Возврат Результат;

КонецФункции

&ИзменениеИКонтроль("ПриЗаписиДокумента")
Процедура смарт_ПриЗаписиДокумента(Назначение, ШаблонНазначения, ЭтотОбъект, Получатель, ВидДеятельностиНДС)

	Если Не ЗначениеЗаполнено(Назначение) Тогда
		Возврат;
	КонецЕсли;

	РеквизитыДокумента = Новый Структура("Номер, Дата, ПометкаУдаления");
	ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ЭтотОбъект);
	РеквизитыДокумента.Вставить("Получатель",         Получатель);
	РеквизитыДокумента.Вставить("ВидДеятельностиНДС", ВидДеятельностиНДС);

	УстановитьПривилегированныйРежим(Истина);
	#Удаление
	РеквизитыНазначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Назначение,
	"Наименование, ПометкаУдаления, Заказ, НаправлениеДеятельности, Партнер, Договор, ВидДеятельностиНДС, ТипНазначения");
	#КонецУдаления
	#Вставка
	//++ #Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.
	РеквизитыНазначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Назначение,
	"Наименование, ПометкаУдаления, Заказ, НаправлениеДеятельности, Партнер, Договор, ВидДеятельностиНДС, ТипНазначения,
	
	//++ #5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка
	|смартПричинаВыводаИзОборота, смартУточнениеПричиныВыводаИзОборота, смартВыведеннаяИзОборотаНоменклатура, смартВыведеннаяИзОборотаСерия,
	//-- #5030 смарт: Тимофеева 02.02.26  
	
	|смартРазобранноеОборудованиеТипНазначения, смартРазобранноеОборудование, смартРазобранноеОборудованиеСерия, смартРазобранноеОборудованиеУзел");
	//-- #Б2340 смарт: Шляпников 17.02.2025
	#КонецВставки

	Если РеквизитыНазначения.Наименование <> Неопределено Тогда

		ПредставлениеНазначения = ПредставлениеНазначения(РеквизитыНазначения, РеквизитыДокумента);

		ОбновитьПометкуУдаления    = ЗначениеЗаполнено(РеквизитыНазначения.Заказ)
		И РеквизитыНазначения.ПометкаУдаления <> РеквизитыДокумента.ПометкаУдаления;
		ОбновитьВидДеятельностиНДС = ЗначениеЗаполнено(РеквизитыНазначения.Заказ)
		И РеквизитыНазначения.ВидДеятельностиНДС <> РеквизитыДокумента.ВидДеятельностиНДС;
		ОбновитьНаименование       = РеквизитыНазначения.Наименование <> ПредставлениеНазначения;

		#Вставка
		//++ #Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.
		Если РеквизитыНазначения.смартРазобранноеОборудованиеТипНазначения <> ШаблонНазначения.смартРазобранноеОборудованиеТипНазначения Тогда
			ОбновитьНаименование = Истина;
		КонецЕсли;
		
		Если РеквизитыНазначения.смартРазобранноеОборудование <> ШаблонНазначения.смартРазобранноеОборудование Тогда
			ОбновитьНаименование = Истина;
		КонецЕсли;
		
		Если РеквизитыНазначения.смартРазобранноеОборудованиеСерия <> ШаблонНазначения.смартРазобранноеОборудованиеСерия Тогда
			ОбновитьНаименование = Истина;
		КонецЕсли;
		
		Если РеквизитыНазначения.смартРазобранноеОборудованиеУзел <> ШаблонНазначения.смартРазобранноеОборудованиеУзел Тогда
			ОбновитьНаименование = Истина;
		КонецЕсли;
		
		Если РеквизитыНазначения.Наименование <> ПредставлениеНазначения Тогда
			ОбновитьНаименование = Истина;
		КонецЕсли;
		//-- #Б2340 смарт: Шляпников 17.02.2025
		//++ #5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка
        Если РеквизитыНазначения.ТипНазначения = Перечисления.ТипыНазначений.смартТоварВыведенныйИзОборота И НЕ ЗначениеЗаполнено(РеквизитыНазначения.Заказ) Тогда
			ОбновитьНаименование = Истина;
		КонецЕсли; 
		//-- #5030 смарт: Тимофеева 02.02.26
		#КонецВставки
		
		Если ОбновитьПометкуУдаления Или ОбновитьВидДеятельностиНДС Или ОбновитьНаименование Тогда

			НазначениеОбъект = Назначение.ПолучитьОбъект();

			Если ОбновитьПометкуУдаления Тогда
				НазначениеОбъект.ПометкаУдаления = РеквизитыДокумента.ПометкаУдаления;
			КонецЕсли;

			Если ОбновитьВидДеятельностиНДС Тогда
				НазначениеОбъект.ВидДеятельностиНДС = РеквизитыДокумента.ВидДеятельностиНДС;
			КонецЕсли;

			Если ОбновитьНаименование Тогда
				НазначениеОбъект.Наименование = ПредставлениеНазначения;
			КонецЕсли;
			
			#Вставка
			//++ #Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.
			НазначениеОбъект.смартРазобранноеОборудованиеТипНазначения = ШаблонНазначения.смартРазобранноеОборудованиеТипНазначения;
			НазначениеОбъект.смартРазобранноеОборудование = ШаблонНазначения.смартРазобранноеОборудование;
			НазначениеОбъект.смартРазобранноеОборудованиеСерия = ШаблонНазначения.смартРазобранноеОборудованиеСерия;
			НазначениеОбъект.смартРазобранноеОборудованиеУзел = ШаблонНазначения.смартРазобранноеОборудованиеУзел;
			//-- #Б2340 смарт: Шляпников 17.02.2025
			//++ #5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка
			Если РеквизитыНазначения.ТипНазначения = Перечисления.ТипыНазначений.смартТоварВыведенныйИзОборота И НЕ ЗначениеЗаполнено(РеквизитыНазначения.Заказ) Тогда
				НазначениеОбъект.Заказ = ШаблонНазначения.Заказ;
			КонецЕсли; 
			НазначениеОбъект.смартПричинаВыводаИзОборота 		  = ШаблонНазначения.смартПричинаВыводаИзОборота;
			НазначениеОбъект.смартУточнениеПричиныВыводаИзОборота = ШаблонНазначения.смартУточнениеПричиныВыводаИзОборота;
			НазначениеОбъект.смартВыведеннаяИзОборотаНоменклатура = ШаблонНазначения.смартВыведеннаяИзОборотаНоменклатура;
			НазначениеОбъект.смартВыведеннаяИзОборотаСерия		  = ШаблонНазначения.смартВыведеннаяИзОборотаСерия;
			//-- #5030 смарт: Тимофеева 02.02.26
			#КонецВставки
			
			НазначениеОбъект.Записать();

		КонецЕсли;

	Иначе // Это новое назначение

		ПредставлениеНазначения = ПредставлениеНазначения(ШаблонНазначения, РеквизитыДокумента);

		НазначениеОбъект = Справочники.Назначения.СоздатьЭлемент();
		НазначениеОбъект.УстановитьСсылкуНового(Назначение);

		НазначениеОбъект.НаправлениеДеятельности = ШаблонНазначения.НаправлениеДеятельности;
		НазначениеОбъект.Партнер                 = ШаблонНазначения.Партнер;
		НазначениеОбъект.Договор                 = ШаблонНазначения.Договор;
		НазначениеОбъект.Заказ                   = ШаблонНазначения.Заказ;
		НазначениеОбъект.ТипНазначения           = ШаблонНазначения.ТипНазначения;
		НазначениеОбъект.Наименование            = ПредставлениеНазначения;
		Если ЗначениеЗаполнено(ШаблонНазначения.Заказ) Тогда
			НазначениеОбъект.ПометкаУдаления    = РеквизитыДокумента.ПометкаУдаления;
			НазначениеОбъект.ВидДеятельностиНДС = РеквизитыДокумента.ВидДеятельностиНДС;
		КонецЕсли;
		
		#Вставка
		//++ #Б2340 смарт: Шляпников 17.02.2025 / Заявка на разборку оборудования. Подготовка справочника Назначения.
		НазначениеОбъект.смартРазобранноеОборудованиеТипНазначения = ШаблонНазначения.смартРазобранноеОборудованиеТипНазначения;
		НазначениеОбъект.смартРазобранноеОборудование = ШаблонНазначения.смартРазобранноеОборудование;
		НазначениеОбъект.смартРазобранноеОборудованиеСерия = ШаблонНазначения.смартРазобранноеОборудованиеСерия;
		НазначениеОбъект.смартРазобранноеОборудованиеУзел = ШаблонНазначения.смартРазобранноеОборудованиеУзел;
		//-- #Б2340 смарт: Шляпников 17.02.2025
		//++ #5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка
		НазначениеОбъект.смартПричинаВыводаИзОборота 		  = ШаблонНазначения.смартПричинаВыводаИзОборота;
		НазначениеОбъект.смартУточнениеПричиныВыводаИзОборота = ШаблонНазначения.смартУточнениеПричиныВыводаИзОборота;
		НазначениеОбъект.смартВыведеннаяИзОборотаНоменклатура = ШаблонНазначения.смартВыведеннаяИзОборотаНоменклатура;
		НазначениеОбъект.смартВыведеннаяИзОборотаСерия		  = ШаблонНазначения.смартВыведеннаяИзОборотаСерия;
		//-- #5030 смарт: Тимофеева 02.02.26
		#КонецВставки
		
		НазначениеОбъект.Записать();

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("НайтиПоШаблону")
Функция смарт_НайтиПоШаблону(Шаблон)

	Результат = Неопределено;

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Назначения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Назначения КАК Назначения
	|ГДЕ
	|	Назначения.НаправлениеДеятельности = &НаправлениеДеятельности
	|	И Назначения.Партнер = &Партнер
	|	И Назначения.Договор = &Договор
	|	И Назначения.Заказ = &Заказ
	|	И Назначения.ТипНазначения = &ТипНазначения";
	
	#Вставка
	ТекстПоиска = "	И Назначения.ТипНазначения = &ТипНазначения";
	ТекстЗамены =
	"	И Назначения.ТипНазначения = &ТипНазначения
	|	И Назначения.смартРазобранноеОборудованиеТипНазначения = &смартРазобранноеОборудованиеТипНазначения
	|	И Назначения.смартРазобранноеОборудование = &смартРазобранноеОборудование
	|	И Назначения.смартРазобранноеОборудованиеСерия = &смартРазобранноеОборудованиеСерия
	|	И Назначения.смартРазобранноеОборудованиеУзел = &смартРазобранноеОборудованиеУзел";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстПоиска, ТекстЗамены);
	
	Запрос.УстановитьПараметр("смартРазобранноеОборудованиеТипНазначения", Шаблон.смартРазобранноеОборудованиеТипНазначения);
	Запрос.УстановитьПараметр("смартРазобранноеОборудование", Шаблон.смартРазобранноеОборудование);
	Запрос.УстановитьПараметр("смартРазобранноеОборудованиеСерия", Шаблон.смартРазобранноеОборудованиеСерия);
	Запрос.УстановитьПараметр("смартРазобранноеОборудованиеУзел", Шаблон.смартРазобранноеОборудованиеУзел);
	
	//++ #5030 смарт: Тимофеева 02.02.26 / Выведенные из оборота товары,  контроль остатков и разделение списка
	ТекстПоиска = "	И Назначения.смартРазобранноеОборудованиеУзел = &смартРазобранноеОборудованиеУзел";
	ТекстЗамены =
	"	И Назначения.смартРазобранноеОборудованиеУзел = &смартРазобранноеОборудованиеУзел
	|	И Назначения.смартПричинаВыводаИзОборота = &смартПричинаВыводаИзОборота
	|	И Назначения.смартУточнениеПричиныВыводаИзОборота = &смартУточнениеПричиныВыводаИзОборота
	|	И Назначения.смартВыведеннаяИзОборотаНоменклатура = &смартВыведеннаяИзОборотаНоменклатура
	|	И Назначения.смартВыведеннаяИзОборотаСерия = &смартВыведеннаяИзОборотаСерия";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ТекстПоиска, ТекстЗамены);
	
	Запрос.УстановитьПараметр("смартПричинаВыводаИзОборота", Шаблон.смартПричинаВыводаИзОборота);
	Запрос.УстановитьПараметр("смартУточнениеПричиныВыводаИзОборота", Шаблон.смартУточнениеПричиныВыводаИзОборота);
	Запрос.УстановитьПараметр("смартВыведеннаяИзОборотаНоменклатура", Шаблон.смартВыведеннаяИзОборотаНоменклатура);
	Запрос.УстановитьПараметр("смартВыведеннаяИзОборотаСерия", Шаблон.смартВыведеннаяИзОборотаСерия);
	//-- #5030 смарт: Тимофеева 02.02.26
	#КонецВставки

	Запрос.УстановитьПараметр("НаправлениеДеятельности", Шаблон.НаправлениеДеятельности);
	Запрос.УстановитьПараметр("Партнер",                 Шаблон.Партнер);
	Запрос.УстановитьПараметр("Договор",                 Шаблон.Договор);
	Запрос.УстановитьПараметр("Заказ",                   Шаблон.Заказ);
	Запрос.УстановитьПараметр("ТипНазначения",           Шаблон.ТипНазначения);

	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти
